app/views/users/index.html.erb

<h1>Users(<%= @users.count %>)</h1>
---
SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users`