app/views/results/show.html.erb

SELECT `user_jobs`.* FROM `user_jobs` WHERE `user_jobs`.`result_id` = 1
---
<h1>Successful</h1>
<%= @result.user_jobs.each do |result| %>