app/controllers/requirements_controller.rb

SELECT `requirements`.* FROM `requirements`
---
  def index
    @requirements = Requirement.all

INSERT INTO `requirements` (`requirement`, `job_id`, `created_at`, `updated_at`) VALUES ('A+, N+', 1, '2017-08-18 08:49:27', '2017-08-18 08:49:27')
---
  def create
    @requirement = Requirement.new(requirement_params)

    if @requirement.save

SELECT  `requirements`.* FROM `requirements` WHERE `requirements`.`id` = 1 LIMIT 1
---
    def set_requirement
      @requirement = Requirement.find(params[:id])