app/controllers/results_controller.rb

SELECT `results`.* FROM `results`
---
  def index
    @results = Result.all

INSERT INTO "results" ("result", "created_at", "updated_at") VALUES (?, ?, ?)  [["result", "Successful"], ["created_at", "2017-08-18 07:45:22.311571"], ["updated_at", "2017-08-18 07:45:22.311571"]]
---
  def create
    @result = Result.new(result_params)

    if @result.save

SELECT  "results".* FROM "results" WHERE "results"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_result
      @result = Result.find(params[:id])