app/controllers/user_jobs_controller.rb

  def index
    @user_jobs = UserJob.all.order("user_id ASC")
---
SELECT `user_jobs`.* FROM `user_jobs` ORDER BY user_id ASC

  def create
    @user_job = UserJob.new(user_job_params)
    #UserMailer.jobs(@user_job).deliver
    if @user_job.save
---
INSERT INTO `user_jobs` (`user_id`, `job_id`, `result_id`, `requirement_id`, `applied`, `interview`, `shortlist`, `final`, `reason`, `created_at`, `updated_at`) VALUES (1, 1, 1, 1, 1, 0, 1, 0, 'aaaa', '2017-08-18 08:50:44', '2017-08-18 08:50:44')

  def update
    if @user_job.update(user_job_params)
---
UPDATE `user_jobs` SET `user_id` = 2, `job_id` = 1, `result_id` = 3, `updated_at` = '2017-08-18 12:50:04' WHERE `user_jobs`.`id` = 4

    def set_user_job
      @user_job = UserJob.find(params[:id])
---
SELECT  "user_jobs".* FROM "user_jobs" WHERE "user_jobs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]